devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
/*=========================================================================*//**
@file    spi.c

@author  Daniel Zorychta

@brief   SPI driver

@note    Copyright (C) 2013 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the  Free Software  Foundation;  either version 2 of the License, or
         any later version.

         This  program  is  distributed  in the hope that  it will be useful,
         but  WITHOUT  ANY  WARRANTY;  without  even  the implied warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         You  should  have received a copy  of the GNU General Public License
         along  with  this  program;  if not,  write  to  the  Free  Software
         Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.


*//*==========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif

/*==============================================================================
  Include files
==============================================================================*/
#include "system/dnxmodule.h"
#include "system/thread.h"
#include "stm32f1/spi_cfg.h"
#include "stm32f1/spi_def.h"
#include "stm32f1/stm32f10x.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define MUTEX_TIMOUT                    MAX_DELAY
#define SEMAPHORE_TIMEOUT               MAX_DELAY
#define MAX_NUMBER_OF_CS                8

#if (_SPI1_NUMBER_OF_SLAVES > MAX_NUMBER_OF_CS) \
 || (_SPI2_NUMBER_OF_SLAVES > MAX_NUMBER_OF_CS) \
 || (_SPI3_NUMBER_OF_SLAVES > MAX_NUMBER_OF_CS)
#error This module support only up to 8 slaves per device!
#endif

/*==============================================================================
  Local object types
==============================================================================*/
/* configuration of single CS line (port and pin) */
struct cs_pin_cfg {
        GPIO_t *const           port;
        u16_t                   pin_mask;
};

/* priority configuration */
struct spi_priority_cfg {
        IRQn_Type               IRQn;
        u32_t                   priority;
};

/* independent SPI instance */
struct spi_virtual {
        u8_t                    major;
        u8_t                    minor;
        struct SPI_config       config;
        dev_lock_t              file_lock;
};

/* general module data */
struct module {
        sem_t                  *wait_irq_sem[_SPI_DEV_NUMBER];
        mutex_t                *device_protect_mtx[_SPI_DEV_NUMBER];
        u8_t                   *buffer[_SPI_DEV_NUMBER];
        size_t                  count[_SPI_DEV_NUMBER];
        bool                    write[_SPI_DEV_NUMBER];
        u8_t                    dummy_byte[_SPI_DEV_NUMBER];
        u8_t                    number_of_virtual_spi[_SPI_DEV_NUMBER];
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void     spi_turn_on             (SPI_t *spi);
static void     spi_turn_off            (SPI_t *spi);
static void     spi_apply_config        (struct spi_virtual *vspi);
static void     spi_apply_safe_config   (u8_t major);
static void     spi_select_slave        (u8_t major, u8_t minor);
static void     spi_deselect_slave      (u8_t major);
static void     spi_irq_handle          (u8_t major);

/*==============================================================================
  Local objects
==============================================================================*/
/* SPI peripherals address */
static SPI_t *const spi[_SPI_DEV_NUMBER] = {
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        SPI1,
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        SPI2,
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        SPI3
#endif
};

/* CS port configuration */
static const struct cs_pin_cfg spi_cs_pin_cfg[_SPI_DEV_NUMBER][MAX_NUMBER_OF_CS] = {
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        {{port: (GPIO_t *)_SPI1_CS0_PORT, pin_mask: (1 << _SPI1_CS0_PIN)},
         {port: (GPIO_t *)_SPI1_CS1_PORT, pin_mask: (1 << _SPI1_CS1_PIN)},
         {port: (GPIO_t *)_SPI1_CS2_PORT, pin_mask: (1 << _SPI1_CS2_PIN)},
         {port: (GPIO_t *)_SPI1_CS3_PORT, pin_mask: (1 << _SPI1_CS3_PIN)},
         {port: (GPIO_t *)_SPI1_CS4_PORT, pin_mask: (1 << _SPI1_CS4_PIN)},
         {port: (GPIO_t *)_SPI1_CS5_PORT, pin_mask: (1 << _SPI1_CS5_PIN)},
         {port: (GPIO_t *)_SPI1_CS6_PORT, pin_mask: (1 << _SPI1_CS6_PIN)},
         {port: (GPIO_t *)_SPI1_CS7_PORT, pin_mask: (1 << _SPI1_CS7_PIN)}},
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        {{port: (GPIO_t *)_SPI2_CS0_PORT, pin_mask: (1 << _SPI2_CS0_PIN)},
         {port: (GPIO_t *)_SPI2_CS1_PORT, pin_mask: (1 << _SPI2_CS1_PIN)},
         {port: (GPIO_t *)_SPI2_CS2_PORT, pin_mask: (1 << _SPI2_CS2_PIN)},
         {port: (GPIO_t *)_SPI2_CS3_PORT, pin_mask: (1 << _SPI2_CS3_PIN)},
         {port: (GPIO_t *)_SPI2_CS4_PORT, pin_mask: (1 << _SPI2_CS4_PIN)},
         {port: (GPIO_t *)_SPI2_CS5_PORT, pin_mask: (1 << _SPI2_CS5_PIN)},
         {port: (GPIO_t *)_SPI2_CS6_PORT, pin_mask: (1 << _SPI2_CS6_PIN)},
         {port: (GPIO_t *)_SPI2_CS7_PORT, pin_mask: (1 << _SPI2_CS7_PIN)}},
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        {{port: (GPIO_t *)_SPI3_CS0_PORT, pin_mask: (1 << _SPI3_CS0_PIN)},
         {port: (GPIO_t *)_SPI3_CS1_PORT, pin_mask: (1 << _SPI3_CS1_PIN)},
         {port: (GPIO_t *)_SPI3_CS2_PORT, pin_mask: (1 << _SPI3_CS2_PIN)},
         {port: (GPIO_t *)_SPI3_CS3_PORT, pin_mask: (1 << _SPI3_CS3_PIN)},
         {port: (GPIO_t *)_SPI3_CS4_PORT, pin_mask: (1 << _SPI3_CS4_PIN)},
         {port: (GPIO_t *)_SPI3_CS5_PORT, pin_mask: (1 << _SPI3_CS5_PIN)},
         {port: (GPIO_t *)_SPI3_CS6_PORT, pin_mask: (1 << _SPI3_CS6_PIN)},
         {port: (GPIO_t *)_SPI3_CS7_PORT, pin_mask: (1 << _SPI3_CS7_PIN)}}
#endif
};

/* number of SPI cs */
static const u8_t spi_number_of_slaves[_SPI_DEV_NUMBER] = {
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        _SPI1_NUMBER_OF_SLAVES,
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        _SPI2_NUMBER_OF_SLAVES,
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        _SPI3_NUMBER_OF_SLAVES
#endif
};

/* IRQ configurations */
static const struct spi_priority_cfg spi_irq[_SPI_DEV_NUMBER] = {
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        {IRQn: SPI1_IRQn, priority: _SPI1_IRQ_PRIORITY},
#endif
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        {IRQn: SPI2_IRQn, priority: _SPI2_IRQ_PRIORITY},
#endif
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        {IRQn: SPI3_IRQn, priority: _SPI3_IRQ_PRIORITY}
#endif
};

/* default SPI config */
static const struct SPI_config spi_default_cfg = {
        dummy_byte : _SPI_DEFAULT_CFG_DUMMY_BYTE,
        clk_divider: _SPI_DEFAULT_CFG_CLK_DIVIDER,
        mode       : _SPI_DEFAULT_CFG_MODE,
        msb_first  : _SPI_DEFAULT_CFG_MSB_FIRST
};

/* pointers to memory of specified device */
static struct module *spi_module;

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
API_MOD_INIT(SPI, void **device_handle, u8_t major, u8_t minor)
{
        if (major >= _SPI_DEV_NUMBER) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }

#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
        if (major == _SPI_DEV_1 && minor >= _SPI1_NUMBER_OF_SLAVES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
#endif

#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
        if (major == _SPI_DEV_2 && minor >= _SPI2_NUMBER_OF_SLAVES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
#endif

#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
        if (major == _SPI_DEV_3 && minor >= _SPI3_NUMBER_OF_SLAVES) {
                errno = ENXIO;
                return STD_RET_ERROR;
        }
#endif

        /* allocate module general data if initialized first time */
        if (!spi_module) {
                spi_module = calloc(1, sizeof(struct module));
                if (!spi_module)
                        return STD_RET_ERROR;
        }

        /* create irq semaphore */
        if (!spi_module->wait_irq_sem[major]) {
                spi_module->wait_irq_sem[major] = semaphore_new(1, 1);
                if (!spi_module->wait_irq_sem[major]) {
                        return STD_RET_ERROR;
                }
        }

        /* create protection mutex and start device if initialized first time */
        if (!spi_module->device_protect_mtx[major]) {
                spi_module->device_protect_mtx[major] = mutex_new(MUTEX_NORMAL);
                if (!spi_module->device_protect_mtx[major]) {
                        semaphore_delete(spi_module->wait_irq_sem[major]);
                        spi_module->wait_irq_sem[major] = NULL;
                        return STD_RET_ERROR;
                } else {
                        NVIC_EnableIRQ(spi_irq[major].IRQn);
                        NVIC_SetPriority(spi_irq[major].IRQn, spi_irq[major].priority);
                        spi_turn_on(spi[major]);
                }
        }

        /* create new instance for specified major-minor number (virtual spi) */
        struct spi_virtual *hdl = calloc(1, sizeof(struct spi_virtual));
        if (!hdl) {
                return STD_RET_ERROR;
        }

        hdl->config    = spi_default_cfg;
        hdl->major     = major;
        hdl->minor     = minor;
        *device_handle = hdl;

        spi_module->number_of_virtual_spi[major]++;

