devdnl/dnx-rtos/src/system/drivers/spi/stm32f1/spi.c
        CLEAR_BIT(SPI->CR1, SPI_CR1_BR);
        SET_BIT(SPI->CR1, divider_mask[vspi->config.clk_divider]);

        /* configure SPI mode */
        switch (vspi->config.mode) {
        case SPI_MODE_0:
                CLEAR_BIT(SPI->CR1, SPI_CR1_CPOL | SPI_CR1_CPHA);
                break;
        case SPI_MODE_1:
                SET_BIT(SPI->CR1, SPI_CR1_CPHA);
                break;
        case SPI_MODE_2:
                SET_BIT(SPI->CR1, SPI_CR1_CPOL);
                break;
        case SPI_MODE_3:
                SET_BIT(SPI->CR1, SPI_CR1_CPOL | SPI_CR1_CPHA);
                break;
        }

        /* 8-bit mode */
        CLEAR_BIT(SPI->CR1, SPI_CR1_DFF);

        /* set MSB/LSB */
        if (vspi->config.msb_first)
                CLEAR_BIT(SPI->CR1, SPI_CR1_LSBFIRST);
        else
                SET_BIT(SPI->CR1, SPI_CR1_LSBFIRST);

        /* NSS software mode */
        SET_BIT(SPI->CR1, SPI_CR1_SSM | SPI_CR1_SSI);

        /* set SPI as master */
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);

        /* enable peripheral */
        SET_BIT(SPI->CR1, SPI_CR1_SPE);
}

//==============================================================================
/**
 * @brief Function apply SPI device safe configuration
 *
 * @param major         SPI major number
 */
//==============================================================================
static void spi_apply_safe_config(u8_t major)
{
        SPI_t *SPI = spi[major];
        u8_t   tmp;

        while (SPI->SR & SPI_SR_BSY)
        CLEAR_BIT(SPI->CR1, SPI_CR1_SPE);
        SET_BIT(SPI->CR1, SPI_CR1_MSTR);
}

//==============================================================================
/**
 * @brief Function select slave device
 *
 * @param major         major device number (SPI device)
 * @param minor         minor device number (CS number)
 */
//==============================================================================
static void spi_select_slave(u8_t major, u8_t minor)
{
        GPIO_t *GPIO = spi_cs_pin_cfg[major][minor].port;
        u16_t   mask = spi_cs_pin_cfg[major][minor].pin_mask;

        GPIO->BRR = mask;
}

//==============================================================================
/**
 * @brief Function deselect current slave device
 *
 * @param major         major device number (SPI device)
 * @param minor         minor device number (CS number)
 */
//==============================================================================
static void spi_deselect_slave(u8_t major)
{
        for (int minor = 0; minor < spi_number_of_slaves[major]; minor++) {
                GPIO_t *GPIO = spi_cs_pin_cfg[major][minor].port;
                u16_t   mask = spi_cs_pin_cfg[major][minor].pin_mask;
                GPIO->BSRR   = mask;
        }
}

//==============================================================================
/**
 * @brief Function handle SPI IRQ
 *
 * @param major        spi device number
 */
//==============================================================================
static void spi_irq_handle(u8_t major)
{
        SPI_t *SPI = spi[major];

        if (spi_module->write[major]) {
                if ((SPI->SR & SPI_SR_TXE) && (SPI->CR2 & SPI_CR2_TXEIE)) {
                        if (spi_module->count[major] > 0) {
                                SPI->DR = *(spi_module->buffer[major]++);
                                spi_module->count[major]--;
                        } else {
                                CLEAR_BIT(SPI->CR2, SPI_CR2_TXEIE);

                                while (SPI->SR & SPI_SR_RXNE) {
                                        int tmp = SPI->DR;
                                        (void) tmp;
                                }

                                SET_BIT(SPI->CR2, SPI_CR2_RXNEIE);
                        }

                        return;
                }

                /* receive recently sent frame to fast disable selected slave */
                if ((SPI->SR & SPI_SR_RXNE) && (SPI->CR2 & SPI_CR2_RXNEIE)) {
                        CLEAR_BIT(SPI->CR2, SPI_CR2_RXNEIE);
                        spi_deselect_slave(major);
                        semaphore_signal_from_ISR(spi_module->wait_irq_sem[major], NULL);
                }
        } else {
                if (SPI->SR & SPI_SR_RXNE) {
                        spi_module->count[major]--;
                        if (spi_module->count[major] > 0) {
                                *(spi_module->buffer[major]++) = SPI->DR;
                                SPI->DR = spi_module->dummy_byte[major];
                        } else {
                                *(spi_module->buffer[major]++) = SPI->DR;
                                spi_deselect_slave(major);
                                semaphore_signal_from_ISR(spi_module->wait_irq_sem[major], NULL);
                                CLEAR_BIT(SPI->CR2, SPI_CR2_RXNEIE);
                        }
                }
        }
}

//==============================================================================
/**
 * @brief SPI1 IRQ handler
 */
//==============================================================================
#if defined(RCC_APB2ENR_SPI1EN) && (_SPI1_ENABLE > 0)
void SPI1_IRQHandler(void)
{
        spi_irq_handle(_SPI_DEV_1);
}
#endif

//==============================================================================
/**
 * @brief SPI2 IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_SPI2EN) && (_SPI2_ENABLE > 0)
void SPI2_IRQHandler(void)
{
        spi_irq_handle(_SPI_DEV_2);
}
#endif

//==============================================================================
/**
 * @brief SPI3 IRQ handler
 */
//==============================================================================
#if defined(RCC_APB1ENR_SPI3EN) && (_SPI3_ENABLE > 0)
void SPI3_IRQHandler(void)
{
        spi_irq_handle(_SPI_DEV_3);
}
#endif

#ifdef __cplusplus
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
